package X;

public abstract class A23 {
    public static final String[] A00;

    static {
        String[] strArr = new String[50];
        System.arraycopy(new String[]{"👌", "🔥", "😋", "🎁", "🎈", "👉", "💙", "💖", "😆", "💯", "🥳", "🎊", "🌹", "🙂", "💜", "💪", "😥", "🤭", "😜", "✅", "🖤", "😇", "✨"}, AnonymousClass7TF.A1X(new String[]{"😂", "🤣", "❤️", "😍", "❤", "😘", "🎂", "🙏", "😊", "😁", "🥰", "🎉", "😭", "😅", "💕", "🤔", "👍", "😉", "😢", "♥️", "💔", "🥺", "🙄", "😎", "🤗", "😔", "👏"}, strArr) ? 1 : 0, strArr, 27, 23);
        A00 = strArr;
    }
}
