package X;

import android.graphics.Color;
import java.util.Map;
import java.util.Set;

public abstract class ACW {
    public static final Map A00 = 0Yt.A06(new 0eP[]{AnonymousClass7TF.A0x(A00("👾,😈,👿,🤡,👹,👺,💟,🔮,💜,💩,🧳,🧸,💼,📦,⚰️,🚪,👀,👁️,🍇,🍆,🍠"), Color.rgb(236, 229, 255)), AnonymousClass7TF.A0x(A00("🎈,💯,💥,🌡️,☄️,⏰,🏮,🧱,🛢️,⛽,🧯,🧰,🧲,💊,⛱️,🔥,🧨,☎️,📌,📍,✂️,🌋,🧧,🎴,🧮,🚨,🖍️,📮,📕,🧶,⛺,🛷,🥌,🎯,🏓,🥊,🗼,⛩️,🎸,🥁,💋,💘,💝,💖,💗,💓,💞,💕,💌,❣️,💔,❤️,💐"), Color.rgb(255, 227, 237)), AnonymousClass7TF.A0x(A00("🌠,🌀,☔,❄️,💧,💦,🧊,🌊,🌍,🌎,🌏,🐳,🐋,🐬,🐟,🐠,💍,💎,💙,🥶,🦋,🤖,🦴,🧵,🧿,🥏,📘,🗽,💠,🚰,🔬,🎭,⛲,🗺️,🗾,🌐"), Color.rgb(235, 244, 255)), AnonymousClass7TF.A0x(A00("😀,😁,😂,🤣,😃,😄,😅,😆,😉,😊,😋,😎,😍,🥰,😘,😗,😙,😚,☺️,🙂,🤗,🤩,🤔,🤨,😐,😑,😶,🙄,😏,😣,😥,😮,🤐,😯,😪,😫,😴,😌,😛,😜,😝,🤤,😒,😓,😔,😕,🙃,😲,☹️,🙁,😖,🥵,😞,😟,🥴,😤,😢,😭,😦,😧,🥳,😨,😩,🤯,😬,😰,😱,😳,🤪,😵,😡,🥺,😠,🤬,😷,🤒,🤕,🤧,😇,🤠,🤥,🤫,🤭,🧐,🤓,🫠,🧡,💛,⭐,✨,🍁,🍂,🏵,🌻,🌼,📙,🧹🎗️,💪,👈,👉,☝️,👆,🖕,👇,✌️,🤞,🖖,🤘,🤙,🖐️,✋,👌,👍,👎,✊,👊,🤛,🤜,🤚,👋,🤟,✍️,👏,👐,🙌,🤲,🙏,🤝,🌛,🌜,☀️,🌝,🌞,🌟,🌙,⚡,😺,😸,😹,😻,😼,😽,🙀,😿,😾"), Color.rgb(255, C355538Qj.DEFAULT_SWIPE_ANIMATION_DURATION, 220)), AnonymousClass7TF.A0x(A00("💚,🌱,🌲,🌳,🌴,🌵,🌾,🌿,☘️,🍀,🍃,🤢,🤮,🤑,🐸,🐊,🐢,🦎,🐍,🐲,🐉,🐛,🦚,🦠,🦖,🦜,⛳,🏝,🛹,🛀,🏔,⛰️,🗻,🏕️,🏖️,🏜️,🏞️,🏟️,🏘️,🏚️,🏠,🏡,🧩,🎾,🥎,📗,📚,🧼,🖼️,🔫,🧪"), Color.rgb(229, 255, 215)), AnonymousClass7TF.A0x(A00("🖤,🎱,🕷️,💣,🎮,🕹️,♟️,🗿,📓,🚥,🚦,📞,📟,🎩,🎓,🖲️,🔇,🔈,🔉,🔊,🎼,🎵,🎶,🎙️,📽️,🎬,📺,📷,📸,📹,📼,🎥,🎹,👣,🕋,✒️,🖋️,🖊️,👽"), Color.rgb(220, 211, 209))});

    public static final Set A00(String str) {
        return 00k.A0k(00l.A0R(str, new String[]{","}, 0));
    }
}
